## [DataFrame 인덱스 다루기]

(1) 모듈 로딩 <hr>

In [46]:
import pandas as pd

(2) 데이터 준비 <hr>

In [47]:
#DataFrame() 함수로 데이터 프레임 변환. 변수 df에 저장.
#dict 타입의 데이터 생성.
exam = {'이름' : [ 'Peter Parker', 'MJ', 'Ned', 'Harry Potter'],

'국어' : [ 100, 94, 95, 32],
'미술' : [ 42, 89, 95, 100],
'수학' : [ 98, 95, 54, 65],
'체육' : [ 98, 90, 43, 100]}

(3) 데이터 저장 <hr>

In [48]:
examDF=pd.DataFrame(exam)

(4) 데이터 확인

In [49]:
examDF

             이름   국어   미술  수학   체육
0  Peter Parker  100   42  98   98
1            MJ   94   89  95   90
2           Ned   95   95  54   43
3  Harry Potter   32  100  65  100

- 행 데이터 추가

In [50]:
# 마징가 98 50 60 77

In [51]:
examDF.loc[4] = ['Peter Parker', 100, 50, 60, 98]

In [52]:
examDF.loc[5] = ['Peter Parker', 100, 54, 98, 91]

In [53]:
examDF

             이름   국어   미술  수학   체육
0  Peter Parker  100   42  98   98
1            MJ   94   89  95   90
2           Ned   95   95  54   43
3  Harry Potter   32  100  65  100
4  Peter Parker  100   50  60   98
5  Peter Parker  100   54  98   91

(5) 새로운 인덱스 설정 - 방법 3 : 멀티인덱스 제어 DF.set_index([컬럼1, 컬럼2,..., 컬럼n])

In [54]:
# 이름, 국어, 수학을 인덱스 설정
examDF.set_index(['이름', '국어', '수학'])

                      미술   체육
이름           국어  수학
Peter Parker 100 98   42   98
MJ           94  95   89   90
Ned          95  54   95   43
Harry Potter 32  65  100  100
Peter Parker 100 60   50   98
                 98   54   91

In [55]:
examDF1 = examDF.set_index(['이름', '국어', '수학'])
examDF1

                      미술   체육
이름           국어  수학
Peter Parker 100 98   42   98
MJ           94  95   89   90
Ned          95  54   95   43
Harry Potter 32  65  100  100
Peter Parker 100 60   50   98
                 98   54   91

In [56]:
examDF1.index

MultiIndex([('Peter Parker', 100, 98),
            (          'MJ',  94, 95),
            (         'Ned',  95, 54),
            ('Harry Potter',  32, 65),
            ('Peter Parker', 100, 60),
            ('Peter Parker', 100, 98)],
           names=['이름', '국어', '수학'])

- 행 데이터 선택 : DF 객체변수명.loc[행레이블] / DF객체변수명.iloc[위치인덱스]

In [57]:
# 행 인덱스 일부 변경 => {기존인덱스 : 새 인덱스}
# inplace 매개변수/파라미터 => 원본 DataFrame의 변경 여부 결정, ※기본은 원본 변경 안함. (False.)
#examDF.rename(index = {0:'★'}, inplace =True) # 원본데이터를 변경하지 않는다. inplace 기본값 False

In [58]:
examDF1.loc[('Peter Parker', 100, 98)]

C:\Users\KDP-024\AppData\Local\Temp\ipykernel_2680\531337903.py:1: PerformanceWarning: indexing past lexsort depth may impact performance.
  examDF1.loc[('Peter Parker', 100, 98)]

                     미술  체육
이름           국어  수학
Peter Parker 100 98  42  98
                 98  54  91

In [59]:
examDF1.loc[('Peter Parker', 100, 60)]

C:\Users\KDP-024\AppData\Local\Temp\ipykernel_2680\3720945078.py:1: PerformanceWarning: indexing past lexsort depth may impact performance.
  examDF1.loc[('Peter Parker', 100, 60)]

                     미술  체육
이름           국어  수학
Peter Parker 100 60  50  98

In [60]:
#keyError 발생 => 
#examDF.loc[(98)]

- 멀티 인덱스의 인덱스의 일부분을 기준으로 행 선택 : xs()
   * 예) 'Peter Parker' 100 98 => Level 0 1 2

In [61]:
examDF1.xs('Peter Parker', level = 0)

        미술  체육
국어  수학
100 98  42  98
    60  50  98
    98  54  91

In [62]:
examDF1.xs(100, level = 1)

                 미술  체육
이름           수학
Peter Parker 98  42  98
             60  50  98
             98  54  91

In [64]:
examDF1.xs(32, level = 1)

                  미술   체육
이름           수학
Harry Potter 65  100  100

- ('마징가', 98, 77), ('임꺽정', 100, 72) 2개 행을 한꺼번에 가져오기. => 여러 개를 가져와야 할 때는 리스트 사용

In [67]:
examDF1.loc[[('Peter Parker', 100, 98),('Ned',  95, 54)]]

                     미술  체육
이름           국어  수학
Peter Parker 100 98  42  98
                 98  54  91
Ned          95  54  95  43

(5) 인덱스 재배치 : 행/열 인덱스를 원하는 순서대로 재비치 + 존재하지 않는 행 / 열 추가  
     *  DF.reindex()

In [ ]:
print(examDF.index, examDF.columns, sep = '\n\n')

- 컬럼명 순서 변경 ==> '체육', '미술', '국어', '수학', '총합'

In [68]:
examDF.reindex(['체육', '미술', '국어', '수학', '총합'], axis = 'columns', fill_value = 0) #원본 불변!

    체육   미술   국어  수학  총합
0   98   42  100  98   0
1   90   89   94  95   0
2   43   95   95  54   0
3  100  100   32  65   0
4   98   50  100  60   0
5   91   54  100  98   0

- 행 인덱스 재배치 : 0,2,4,1,3,5

In [69]:
examDF.reindex([0,2,4,1,3,5], axis = 'index', fill_value =0)

             이름   국어   미술  수학   체육
0  Peter Parker  100   42  98   98
2           Ned   95   95  54   43
4  Peter Parker  100   50  60   98
1            MJ   94   89  95   90
3  Harry Potter   32  100  65  100
5  Peter Parker  100   54  98   91

- 컬럼명 순서 변경 ==> 체육 미술 국어 수학 총합 + 행인덱스 => 0,2,4,1,3,5 재배치

In [71]:
examDF.reindex(index = [0,2,4,1,3,5], columns = ['체육', '미술', '국어', '수학', '총합'], fill_value = 0)

    체육   미술   국어  수학  총합
0   98   42  100  98   0
2   43   95   95  54   0
4   98   50  100  60   0
1   90   89   94  95   0
3  100  100   32  65   0
5   91   54  100  98   0

- (5) 새로운 인덱스 설정 - 방법 3 :

In [ ]:
examDF.set_index('이름', inplace = True) # 원본 적용.

In [ ]:
#현재 행 인덱스 ==> columns 추가
df1 = examDF.reset_index() #reset_index는 행에 0, 1, 2, 3... 를 붙이는 것
examDF.reset_index().reset_index().reset_index()

In [ ]:
df1

In [ ]:
#현재 행 인덱스를 컬럼에 추가하지 않고 삭제 => drop 파라미터를 True로 설정.
df2 = examDF.reset_index(drop =True)

In [ ]:
df2